# -*- coding: gbk -*-
#################################################################################################
#                                广东发展银行主机通讯相关的正则表达式定义
#================================================================================================
#                                    作    者：    陈 显 明
#                                    修改时间：    20060814
#################################################################################################
#    由于字符串含有"（"，请不要用编辑器的自动格式化功能，否则造成字符串变化使得结果出错(不是正确的正则表达式)
import re

pComment = re.compile("^\s*\#.*")
pBlank = re.compile("^\s*$")
pCommDefField = re.compile("^\s*(\d+)\s+(\w+)\s+(\d+)\s+(\w+)\s+(\w+)\s+'(.*)'\s+(\S*)\s*")

pForb = re.compile("^\s*forb\s+(\d+)\s+(\w+)\s+(\w+)\s+(\w+)\s*")
pFore = re.compile("^\s*fore\s*")

